spark-empty/crash-as/com/as.infrastructure/arch/lm3s/DriverLib/src/can.c
    if(ulCANError & CAN_ERR_RP)
    {
        return(true);
    }
    return(false);
}

//*****************************************************************************
//
//! Configures a message object in the CAN controller.
//!
//! \param ulBase is the base address of the CAN controller.
//! \param ulObjID is the object number to configure (1-32)
//! \param pMsgObject is a pointer to a structure containing message object
//! settings.
//! \param eMsgType Indicates what type of message this object is.
//!
//! This function is used to configure any one of the 32 message objects in the
//! CAN controller.  A message object can be configured as any type of CAN
//! message object as well as several options for automatic transmission and
//! reception.  This call also allows the message object to be configured to
//! generate interrupts on completion of message receipt or transmission.  The
//! message object can also be configured with a filter/mask so that actions
//! are only taken when a message that meets certain parameters is seen on the
//! CAN bus.
//!
//! The \e eMsgType parameter must be one of the following values:
//!
//! - MSG_OBJ_TYPE_TX - CAN transmit message object.
//! - MSG_OBJ_TYPE_TX_REMOTE - CAN transmit remote request message
//! object.
//! - MSG_OBJ_TYPE_RX - CAN receive message object.
//! - MSG_OBJ_TYPE_RX_REMOTE - CAN receive remote request message object.
//! - MSG_OBJ_TYPE_RXTX_REMOTE - CAN remote frame receive remote, then
//! transmit message object.
//!
//! The message object pointed to by \e pMsgObject must be populated by the
//! caller, as follows:
//!
//! - \e ulMsgID - contains the message ID, either 11 or 29 bits.
//! - \e ulMsgIDMask - mask of bits from \e ulMsgID that must match if
//! identifier filtering is enabled.
//! - \e ulFlags
//!   - Set MSG_OBJ_TX_INT_ENABLE flag to enable interrupt on transmission.
//!   - Set MSG_OBJ_RX_INT_ENABLE flag to enable interrupt on receipt.
//!   - Set MSG_OBJ_USE_ID_FILTER flag to enable filtering based on the
//!   identifier mask specified by \e ulMsgIDMask.
//! - \e ulMsgLen - the number of bytes in the message data.  This should be
//! non-zero even for a remote frame - it should match the expected bytes of
//! the data responding data frame.
//! - \e pucMsgData - points to a buffer containing up to 8 bytes of data
//! for a data frame
//!
//! To send a data frame or remote frame directly, take the following steps:
//!
//! - set \e tMsgObjType to MSG_OBJ_TYPE_TX.
//! - set \e ulMsgID to the message ID.
//! - set \e ulFlags Set MSG_OBJ_TX_INT_ENABLE to to get an interrupt when the
//! message is sent. To disable filtering based on message identifiers, do not
//! set MSG_OBJ_USE_ID_FILTER.
//! - set \e ulMsgLen to the number of bytes in the data frame.
//! - set \e pucMsgData to point to an array containing the bytes in the
//! message (if a data frame, n/a if remote frame, though it is a good
//! idea to set this to point to a valid buffer).
//! - call this function with \e ulObjID set to one of the 32 object buffers.
//!
//! To receive a specific data frame, take the following steps:
//!
//! - set \e tMsgObjType to MSG_OBJ_TYPE_RX.
//! - set \e ulMsgID to the full message ID, or a partial mask to use partial
//! ID matching.
//! - set \e ulMsgIDMask bits that should be used for masking during
//! comparison.
//! - \e ulFlags
//!   - Set MSG_OBJ_TX_INT_ENABLE flag to be interrupted when the data frame is
//!   received.
//!   - Set MSG_OBJ_USE_ID_FILTER flag to enable identifier based filtering.
//! - set \e ulMsgLen to the number of bytes in the expected data frame
//! - the buffer pointed to by \e pucMsgData is not used for this call
//! - call this function with \e ulObjID set to one of the 32 object buffers
//!
//! If you specify a message object buffer that already contains a message
//! definition, it will be overwritten.
//!
//! \return None.
//
//*****************************************************************************
void
CANMessageSet(unsigned long ulBase, unsigned long ulObjID,
              tCANMsgObject *pMsgObject, tMsgObjType eMsgType)
{
    unsigned short usCmdMaskReg;
    unsigned short usMaskReg[2];
    unsigned short usArbReg[2];
    unsigned short usMsgCtrl;
    tBoolean bTransferData;
    tBoolean bUseExtendedID;

    bTransferData = 0;

    //
    // Check the arguments.
    //
    ASSERT((ulBase == CAN0_BASE) ||
           (ulBase == CAN1_BASE) ||
           (ulBase == CAN2_BASE));
    ASSERT((ulObjID <= 32) && (ulObjID != 0));
    ASSERT((eMsgType == MSG_OBJ_TYPE_TX) ||
           (eMsgType == MSG_OBJ_TYPE_TX_REMOTE) ||
           (eMsgType == MSG_OBJ_TYPE_RX) ||
           (eMsgType == MSG_OBJ_TYPE_RX_REMOTE) ||
           (eMsgType == MSG_OBJ_TYPE_TX_REMOTE) ||
           (eMsgType == MSG_OBJ_TYPE_RXTX_REMOTE));

    //
    // Wait for busy bit to clear
    //
    while(CANReadReg(ulBase + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY)
    {
    }

    //
    // See if we need to use an extended identifier or not.
    //
    if((pMsgObject->ulMsgID > CAN_MAX_11BIT_MSG_ID) ||
       (pMsgObject->ulFlags & MSG_OBJ_EXTENDED_ID))
    {
        bUseExtendedID = 1;
    }
    else
    {
        bUseExtendedID = 0;
    }

    //
    // This is always a write to the Message object as this call is setting
    // a message object.
    // This call will also always set all size bits so it sets both data bits.
    // The call will use the CONTROL register to set control bits so this bit
    // needs to be set as well.
    //
    usCmdMaskReg = CAN_IFCMSK_WRNRD | CAN_IFCMSK_DATAA | CAN_IFCMSK_DATAB |
        CAN_IFCMSK_CONTROL;

    //
    // Initialize the values to a known state before filling them in based
    // on the type of message object that is being configured.
    //
    usArbReg[0] = 0;
    usMsgCtrl = 0;
    usMaskReg[0] = 0;
    usMaskReg[1] = 0;

    switch(eMsgType)
    {
        //
        // Transmit message object.
        //
        case MSG_OBJ_TYPE_TX:
        {
            //
            // Set the TXRQST bit and the reset the rest of the register.
            //
            usMsgCtrl |= CAN_IFMCTL_TXRQST;
            usArbReg[1] = CAN_IFARB2_DIR;
            bTransferData = 1;
            break;
        }

        //
        // Transmit remote request message object
        //
        case MSG_OBJ_TYPE_TX_REMOTE:
        {
            //
            // Set the TXRQST bit and the reset the rest of the register.
            //
            usMsgCtrl |= CAN_IFMCTL_TXRQST;
            usArbReg[1] = 0;
            break;
        }

        //
        // Receive message object.
        //
        case MSG_OBJ_TYPE_RX:
        {
            //
            // This clears the DIR bit along with everthing else.  The
            // TXRQST bit was cleard by defaulting usMsgCtrl to 0.
            //
            usArbReg[1] = 0;
            break;
        }

        //
        // Receive remote request message object.
        //
        case MSG_OBJ_TYPE_RX_REMOTE:
        {
            //
            // The DIR bit is set to one for remote receivers.  The
            // TXRQST bit was cleard by defaulting usMsgCtrl to 0.
            //
            usArbReg[1] = CAN_IFARB2_DIR;

            //
            // Set this object so that it only indicates that a remote frame
            // was received and allow for software to handle it by sending back
            // a data frame.
            //
            usMsgCtrl = CAN_IFMCTL_UMASK;

            //
            // Use the full Identifier by default.
            //
            usMaskReg[0] = 0xffff;
            usMaskReg[1] = 0x1fff;

            //
            // Make sure to send the mask to the message object.
            //
            usCmdMaskReg |= CAN_IFCMSK_MASK;
            break;
        }

        //
        // Remote frame receive remote, with auto-transmit message object.
        //
        case MSG_OBJ_TYPE_RXTX_REMOTE:
        {
            //
            // Oddly the DIR bit is set to one for remote receivers.
            //
            usArbReg[1] = CAN_IFARB2_DIR;

            //
            // Set this object to auto answer if a matching identifier is seen.
            //
            usMsgCtrl = CAN_IFMCTL_RMTEN | CAN_IFMCTL_UMASK;

            //
            // The data to be returned needs to be filled in.
            //
            bTransferData = 1;
            break;
        }

        //
        // This case should never happen due to the ASSERT statement at the
        // beginning of this function.
        //
        default:
        {
            return;
        }
    }

    //
    // Configure the Mask Registers.
    //
    if(pMsgObject->ulFlags & MSG_OBJ_USE_ID_FILTER)
    {
        if(bUseExtendedID)
        {
            //
            // Set the 29 bits of Identifier mask that were requested.
            //
            usMaskReg[0] = pMsgObject->ulMsgIDMask & CAN_IFMSK1_MSK;
            usMaskReg[1] = (pMsgObject->ulMsgIDMask >> 16) & CAN_IFMSK2_MSK;
        }
        else
        {
            //
            // Lower 16 bit are unused so set them to zero.
            //
            usMaskReg[0] = 0;
            //
            // Put the 11 bit Mask Identifier into the upper bits of the field
            // in the register.
            //
            usMaskReg[1] = (pMsgObject->ulMsgIDMask << 2) & CAN_IFMSK2_MSK;
        }
    }

    //
    // If the caller wants to filter on the extended ID bit then set it.
    //
    if((pMsgObject->ulFlags & MSG_OBJ_USE_EXT_FILTER) ==
        MSG_OBJ_USE_EXT_FILTER)
    {
        usMaskReg[1] |= CAN_IFMSK2_MXTD;
    }

    //
    // The caller wants to filter on the message direction field.
    //
    if((pMsgObject->ulFlags & MSG_OBJ_USE_DIR_FILTER) ==
        MSG_OBJ_USE_DIR_FILTER)
    {
        usMaskReg[1] |= CAN_IFMSK2_MDIR;
    }

    if(pMsgObject->ulFlags & (MSG_OBJ_USE_ID_FILTER | MSG_OBJ_USE_DIR_FILTER |
       MSG_OBJ_USE_EXT_FILTER))
    {
        //
        // Set the UMASK bit to enable using the mask register.
        //
        usMsgCtrl |= CAN_IFMCTL_UMASK;

        //
        // Set the MASK bit so that this gets trasferred to the Message Object.
        //
        usCmdMaskReg |= CAN_IFCMSK_MASK;
    }

    //
    // Set the Arb bit so that this gets transferred to the Message object.
    //
    usCmdMaskReg |= CAN_IFCMSK_ARB;

    //
    // Configure the Arbitration registers.
    //
    if(bUseExtendedID)
    {
        //
        // Set the 29 bit version of the Identifier for this message object.
        //
        usArbReg[0] |= pMsgObject->ulMsgID & CAN_IFARB1_ID;
        usArbReg[1] |= (pMsgObject->ulMsgID >> 16) & CAN_IFARB2_ID;

        //
        // Mark the message as valid and set the extended ID bit.
        //
        usArbReg[1] |= CAN_IFARB2_MSGVAL | CAN_IFARB2_XTD;
    }
    else
    {
        //
        // Set the 11 bit version of the Identifier for this message object.
        // The lower 18 bits are set to zero.
        //
        usArbReg[1] |= (pMsgObject->ulMsgID << 2) & CAN_IFARB2_ID;

        //
        // Mark the message as valid.
        //
        usArbReg[1] |= CAN_IFARB2_MSGVAL;
    }

    //
    // Set the data length since this is set for all transfers.
    // This is also a single transfer and not a FIFO transfer so set EOB bit.
    //
    usMsgCtrl |= (pMsgObject->ulMsgLen & CAN_IFMCTL_DLC) | CAN_IFMCTL_EOB;

    //
    // Enable transmit interrupts if they should be enabled.
    //
    if(pMsgObject->ulFlags & MSG_OBJ_TX_INT_ENABLE)
    {
        usMsgCtrl |= CAN_IFMCTL_TXIE;
    }

    //
    // Enable receive interrupts if they should be enabled.
    //
    if(pMsgObject->ulFlags & MSG_OBJ_RX_INT_ENABLE)
    {
        usMsgCtrl |= CAN_IFMCTL_RXIE;
    }

    //
    // Write the data out to the CAN Data registers if needed.
    //
    if(bTransferData)
    {
        CANWriteDataReg(
            pMsgObject->pucMsgData,
            (unsigned long *)(ulBase + CAN_O_IF1DA1), pMsgObject->ulMsgLen);
    }

    //
    // Write out the registers to program the message object.
    //
    CANWriteReg(ulBase + CAN_O_IF1CMSK, usCmdMaskReg);
    CANWriteReg(ulBase + CAN_O_IF1MSK1, usMaskReg[0]);
    CANWriteReg(ulBase + CAN_O_IF1MSK2, usMaskReg[1]);
    CANWriteReg(ulBase + CAN_O_IF1ARB1, usArbReg[0]);
    CANWriteReg(ulBase + CAN_O_IF1ARB2, usArbReg[1]);
    CANWriteReg(ulBase + CAN_O_IF1MCTL, usMsgCtrl);

    //
    // Transfer the message object to the message object specifiec by ulObjID.
    //
    CANWriteReg(ulBase + CAN_O_IF1CRQ, ulObjID & CAN_IFCRQ_MNUM_MSK);

    return;
}

//*****************************************************************************
//
//! Reads a CAN message from one of the message object buffers
//!
//! \param ulBase is the base address of the CAN controller.
//! \param ulObjID is the object number to read (1-32)
//! \param pMsgObject points to a structure containing message object fields
//! \param bClrPendingInt indicates whether an associated interrupt should
//! be cleared
//!
//! This function is used to read the contents of one of the 32 message
//! objects in the CAN controller, and return it to the caller.  The data
//! returned is stored in the fields of the caller supplied structure pointed
//! to by \e pMsgObject.  The data consists of all of the parts of a CAN
//! message, plus some control and status information.
//!
//! Normally this is used to read a message object that has received and
//! stored a CAN message with a certain identifier.  However this could also be
//! used to read the contents of a message object in order to load the fields
//! of the structure in case only part of the structure needs to be changed
//! from a previous setting.
//!
//! When using CANMessageGet, all of the same fields of the structure are
//! populated in the same way as when the CANMessageSet() function is used,
//! with the following exceptions:
//!
//! \e pMsgObject->ulFlags:
//!
//! - MSG_OBJ_NEW_DATA indicates if this is new data since the last
//! time it was read
//! - MSG_OBJ_DATA_LOST indicates that at least one message was received
//! on this message object, and not read by the host before being
//! overwritten.
//!
//! \return None.
//
//*****************************************************************************
void
CANMessageGet(unsigned long ulBase, unsigned long ulObjID,
              tCANMsgObject *pMsgObject, tBoolean bClrPendingInt)
{
    unsigned short usCmdMaskReg;
    unsigned short usMaskReg[2];
    unsigned short usArbReg[2];
    unsigned short usMsgCtrl;

    //
    // Check the arguments.
    //
    ASSERT((ulBase == CAN0_BASE) ||
           (ulBase == CAN1_BASE) ||
           (ulBase == CAN2_BASE));
    ASSERT((ulObjID <= 32) && (ulObjID != 0));

    //
    // This is always a read to the Message object as this call is setting
    // a message object.
    //
    usCmdMaskReg = CAN_IFCMSK_DATAA | CAN_IFCMSK_DATAB | CAN_IFCMSK_CONTROL |
                   CAN_IFCMSK_MASK | CAN_IFCMSK_ARB;

    //
    // Clear a pending interrupt and new data in a message object.
    //
    if(bClrPendingInt)
    {
        usCmdMaskReg |= CAN_IFCMSK_CLRINTPND;
    }

    //
    // Set up the request for data from the message object.
    //
    CANWriteReg(ulBase + CAN_O_IF2CMSK, usCmdMaskReg);

    //
    // Transfer the message object to the message object specifiec by ulObjID.
    //
    CANWriteReg(ulBase + CAN_O_IF2CRQ, ulObjID & CAN_IFCRQ_MNUM_MSK);

    //
    // Wait for busy bit to clear
    //
    while(CANReadReg(ulBase + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY)
    {
    }

    //
    // Read out the IF Registers.
    //
    usMaskReg[0] = CANReadReg(ulBase + CAN_O_IF2MSK1);
    usMaskReg[1] = CANReadReg(ulBase + CAN_O_IF2MSK2);
    usArbReg[0] = CANReadReg(ulBase + CAN_O_IF2ARB1);
    usArbReg[1] = CANReadReg(ulBase + CAN_O_IF2ARB2);
    usMsgCtrl = CANReadReg(ulBase + CAN_O_IF2MCTL);

    pMsgObject->ulFlags = MSG_OBJ_NO_FLAGS;

    //
    // Determine if this is a remote frame by checking the TXRQST and DIR bits.
    //
    if((!(usMsgCtrl & CAN_IFMCTL_TXRQST) && (usArbReg[1] & CAN_IFARB2_DIR)) ||
       ((usMsgCtrl & CAN_IFMCTL_TXRQST) && (!(usArbReg[1] & CAN_IFARB2_DIR))))
    {
        pMsgObject->ulFlags |= MSG_OBJ_REMOTE_FRAME;
    }

    //
    // Get the Identifier out of the register, the format depends on size of
    // the Mask.
    //
    if(usArbReg[1] & CAN_IFARB2_XTD)
    {
        //
        // Set the 29 bit version of the Identifier for this message object.
        //
        pMsgObject->ulMsgID = ((usArbReg[1] & CAN_IFARB2_ID) << 16) |
            usArbReg[0];

